In [2]:
import pandas as pd

/tmp/ipykernel_20538/4080736814.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [3]:
sozluk = {
    'Kategori': [
        'Giyim',
        'Giyim',
        'Ayakkabi',
        'Aksesuar',
        'Ayakkabi',
        'Giyim',
        'Aksesuar',
        'Aksesuar',
        'Ayakkabi',
        'Giyim',
    ],

    'Urun': [
        'Kazak',
        'T-shirt',
        'Sandalet',
        'Kupe',
        'Spor Ayakkabi',
        'Pantolon',
        'Kolye',
        'Yuzuk',
        'Cizme',
        'Ceket',
    ],

    'Fiyat': [
        300,
        180,
        450,
        50,
        700,
        400,
        150,
        80,
        850,
        900,
    ],
}

In [6]:
df = pd.DataFrame(sozluk)
df

   Kategori           Urun  Fiyat
0     Giyim          Kazak    300
1     Giyim        T-shirt    180
2  Ayakkabi       Sandalet    450
3  Aksesuar           Kupe     50
4  Ayakkabi  Spor Ayakkabi    700
5     Giyim       Pantolon    400
6  Aksesuar          Kolye    150
7  Aksesuar          Yuzuk     80
8  Ayakkabi          Cizme    850
9     Giyim          Ceket    900

In [9]:
df['Kategori'].loc[2]

'Ayakkabi'

In [26]:
df['Urun'].loc[2]

'Sandalet'

In [24]:
df.loc[4:9]

   Kategori           Urun  Fiyat
4  Ayakkabi  Spor Ayakkabi    700
5     Giyim       Pantolon    400
6  Aksesuar          Kolye    150
7  Aksesuar          Yuzuk     80
8  Ayakkabi          Cizme    850
9     Giyim          Ceket    900

In [30]:
df.loc[1:6, 'Urun']

1          T-shirt
2         Sandalet
3             Kupe
4    Spor Ayakkabi
5         Pantolon
6            Kolye
Name: Urun, dtype: object

In [47]:
df[df['Kategori'] == 'Giyim']

  Kategori      Urun  Fiyat
0    Giyim     Kazak    300
1    Giyim   T-shirt    180
5    Giyim  Pantolon    400
9    Giyim     Ceket    900

In [46]:
df[df['Kategori'] == 'Ayakkabi']

   Kategori           Urun  Fiyat
2  Ayakkabi       Sandalet    450
4  Ayakkabi  Spor Ayakkabi    700
8  Ayakkabi          Cizme    850

In [45]:
df[df['Kategori'] == 'Aksesuar']

   Kategori   Urun  Fiyat
3  Aksesuar   Kupe     50
6  Aksesuar  Kolye    150
7  Aksesuar  Yuzuk     80

In [51]:
df[(df['Kategori'] == 'Giyim') & (df['Fiyat'] > 300)]

  Kategori      Urun  Fiyat
5    Giyim  Pantolon    400
9    Giyim     Ceket    900

In [52]:
df[(df['Kategori'] == 'Ayakkabi') & (df['Fiyat'] < 600)]

   Kategori      Urun  Fiyat
2  Ayakkabi  Sandalet    450

In [54]:
df[(df['Kategori'] == 'Aksesuar') & (df['Fiyat'] > 100)]

   Kategori   Urun  Fiyat
6  Aksesuar  Kolye    150